In [2]:
# DataFrame
import pandas as pd

name = ['Rahul', 'Pavan', 'Queen', 'King', 'Ravi']
area = ['Pune', 'Delhi', 'Bangalore', 'Noida', 'Punewest']
Math = [34,67,89,100,45]
English = [66,88,99,77,34]
Science = [77,88,45,90,23]

Details = {
    'Name':name, 
    "Area":area, 
    "Math":Math, 
    "English":English,
    "Science":Science
}
data = pd.DataFrame(Details)
print(data)

    Name       Area  Math  English  Science
0  Rahul       Pune    34       66       77
1  Pavan      Delhi    67       88       88
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90
4   Ravi   Punewest    45       34       23

In [3]:
data.loc[0]

Name       Rahul
Area        Pune
Math          34
English       66
Science       77
Name: 0, dtype: object

In [19]:
data.loc[0,["Science"]]

Science    77
Name: 0, dtype: object

In [21]:
data.loc[2:3]

    Name       Area  Math  English  Science
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90

In [24]:
data.loc[2:3,["Science"]]

   Science
2       45
3       90

In [25]:
data.loc[2:3,["Name","Science"]]

    Name  Science
2  Queen       45
3   King       90

In [27]:
data.loc[2:3,"Math":"Science"]

   Math  English  Science
2    89       99       45
3   100       77       90

# understanding iloc(stop index excluded)

In [6]:
print(data)

    Name       Area  Math  English  Science
0  Rahul       Pune    34       66       77
1  Pavan      Delhi    67       88       88
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90
4   Ravi   Punewest    45       34       23

In [10]:
data.iloc[3,3] # iloc[rowno,columnno]

77

In [11]:
data.iloc[1:3,0:2] # iloc[rowStart:rowStop, colStart:colStop]

    Name       Area
1  Pavan      Delhi
2  Queen  Bangalore

In [14]:
data.iloc[1:3,0] # iloc[Start:Stop, colno]

1    Pavan
2    Queen
Name: Name, dtype: object

In [16]:
data.iloc[[1,3,4,3]] # iloc[[row1,row3,row5,3]]

    Name      Area  Math  English  Science
1  Pavan     Delhi    67       88       88
3   King     Noida   100       77       90
4   Ravi  Punewest    45       34       23
3   King     Noida   100       77       90

In [19]:
data.iloc[:,[1,3,4,3]] # iloc[:,[col1,col3,col5,col3]]

        Area  English  Science  English
0       Pune       66       77       66
1      Delhi       88       88       88
2  Bangalore       99       45       99
3      Noida       77       90       77
4   Punewest       34       23       34

In [20]:
data.iloc[1:5,[1,3,4,3]] # iloc[rowstart:rowstop,[col1,col3,col5,col3]]

        Area  English  Science  English
1      Delhi       88       88       88
2  Bangalore       99       45       99
3      Noida       77       90       77
4   Punewest       34       23       34

In [ ]:
## now learn to import csv file and excel file